Revit 2020 API
AdvancedLayered Members
The AdvancedLayered type exposes the following members.
Properties
Name | Description
LayeredAnisotropy
 The property labeled "Anisotropy" from the "PrismLayered" schema.
LayeredBottomF0
 The property labeled "Color" from the "PrismLayered" schema.
LayeredDiffuse
 The property labeled "Color" from the "PrismLayered" schema.
LayeredF0
 The property labeled "Clearcoat reflectance" from the "PrismLayered" schema.
LayeredFraction
 The property labeled "Fraction" from the "PrismLayered" schema.
LayeredNdfType
 The property labeled "NDF" from the "PrismLayered" schema.
LayeredNormal
 The property labeled "Image" from the "PrismLayered" schema.
LayeredRotation
 The property labeled "Rotation" from the "PrismLayered" schema.
LayeredRoughness
 The property labeled "Roughness" from the "PrismLayered" schema.
SurfaceAlbedo
 The property labeled "Color" from the "PrismLayered" schema.
SurfaceAnisotropy
 The property labeled "Anisotropy" from the "PrismLayered" schema.
SurfaceCutout
 The property labeled "Image" from the "PrismLayered" schema.
SurfaceNdfType
 The property labeled "NDF" from the "PrismLayered" schema.
SurfaceNormal
 The property labeled "Image" from the "PrismLayered" schema.
SurfaceRotation
 The property labeled "Rotation" from the "PrismLayered" schema.
SurfaceRoughness
 The property labeled "Roughness" from the "PrismLayered" schema.
See Also
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace